app/Models/BillOfMaterialModel.php

SELECT *
FROM `detail_bill_of_material`
JOIN `persediaan_bahan` ON `persediaan_bahan`.`id_bahan` = `detail_bill_of_material`.`id_bahan`
WHERE `detail_bill_of_material`.`id_bom` = '2'
---
    public function editBillOfMaterial($idBom)
    {
        $query = $this->db->table('detail_bill_of_material')
            ->select('*')
            ->join('persediaan_bahan', 'persediaan_bahan.id_bahan = detail_bill_of_material.id_bahan')
            ->where('detail_bill_of_material.id_bom', $idBom)
            ->get();

SELECT *
FROM `bill_of_material`
JOIN `produk` ON `produk`.`id_produk` = `bill_of_material`.`id_produk`
WHERE `bill_of_material`.`id_bom` = '2'
---
    public function getNameProduk($idBom)
    {
        $query = $this->db->table('bill_of_material')
            ->select('*')
            ->join('produk', 'produk.id_produk = bill_of_material.id_produk')
            ->where('bill_of_material.id_bom', $idBom)
            ->get();