app/Models/BillOfMaterialModel.php

    public function getDataProduk()
    {
        $query = $this->db->table('produk')
            ->where('produk.id_perusahaan', session()->get('idPerusahaan'))
            ->get();
---
SELECT *
FROM `produk`
WHERE `produk`.`id_perusahaan` = '1'