app/Models/BillOfMaterialModel.php

SELECT *
FROM `bill_of_material`
JOIN `produk` ON `produk`.`id_produk` = `bill_of_material`.`id_produk`
WHERE `bill_of_material`.`status_aktif` = 1
AND `bill_of_material`.`id_perusahaan` = '1'
---
    public function indexBillOfMaterial()
    {
        $query = $this->db->table('bill_of_material')
            ->join('produk', 'produk.id_produk = bill_of_material.id_produk')
            ->where('bill_of_material.status_aktif', 1)
            ->where('bill_of_material.id_perusahaan', session()->get('idPerusahaan'))
            ->get();

SELECT *
FROM `detail_bill_of_material`
JOIN `persediaan_bahan` ON `persediaan_bahan`.`id_bahan` = `detail_bill_of_material`.`id_bahan`
WHERE `detail_bill_of_material`.`id_bom` = '5'
AND `detail_bill_of_material`.`status_aktif` = 1
---
    public function showBillOfMaterial($idBom)
    {
        $query = $this->db->table('detail_bill_of_material')
            ->join('persediaan_bahan', 'persediaan_bahan.id_bahan = detail_bill_of_material.id_bahan')
            ->where('detail_bill_of_material.id_bom', $idBom)
            ->where('detail_bill_of_material.status_aktif', 1)
            ->get();

SELECT *
FROM `detail_bill_of_material`
JOIN `persediaan_bahan` ON `persediaan_bahan`.`id_bahan` = `detail_bill_of_material`.`id_bahan`
WHERE `detail_bill_of_material`.`id_bom` = '6'
AND `detail_bill_of_material`.`status_aktif` = 1
---
    public function editBillOfMaterial($idBom)
    {
        $query = $this->db->table('detail_bill_of_material')
            ->select('*')
            ->join('persediaan_bahan', 'persediaan_bahan.id_bahan = detail_bill_of_material.id_bahan')
            ->where('detail_bill_of_material.id_bom', $idBom)
            ->where('detail_bill_of_material.status_aktif', 1)
            ->get();

UPDATE `detail_bill_of_material` SET `status_aktif` = 0
WHERE `id_detail_bom` = '9'
---
    public function removeBillOfMaterial()
    {
        $jumlahInputDelete = $this->request->getVar('jumlah_bom');
        for ($i = 1; $i <= $jumlahInputDelete; $i++) {
            $idDetailBom = $this->request->getVar("id_detail_bom{$i}");
            $data = [
                'status_aktif' => 0
            ];

            $this->db->table('detail_bill_of_material')
                ->where('id_detail_bom', $idDetailBom)
                ->update($data);

UPDATE `detail_bill_of_material` SET `status_aktif` = 0
WHERE `id_bom` = '5'
UPDATE `bill_of_material` SET `status_aktif` = 0
WHERE `id_bom` = '5'
---
    public function removeAllBillOfMaterial($idBom)
    {
        $data = [
            'status_aktif' => 0
        ];

        $this->db->table('detail_bill_of_material')
            ->where('id_bom', $idBom)
            ->update($data);

        $this->db->table('bill_of_material')
            ->where('id_bom', $idBom)
            ->update($data);

SELECT *
FROM `produk`
WHERE `produk`.`id_perusahaan` = '1'
---
    public function getDataProduk()
    {
        $query = $this->db->table('produk')
            ->where('produk.id_perusahaan', session()->get('idPerusahaan'))
            ->get();

SELECT *
FROM `bill_of_material`
JOIN `produk` ON `produk`.`id_produk` = `bill_of_material`.`id_produk`
WHERE `bill_of_material`.`id_bom` = '7'
---
    public function getNameProduk($idBom)
    {
        $query = $this->db->table('bill_of_material')
            ->select('*')
            ->join('produk', 'produk.id_produk = bill_of_material.id_produk')
            ->where('bill_of_material.id_bom', $idBom)
            ->get();