app/Models/JenisSatuanModel.php

    public function indexJenisSatuan()
    {
        $db = db_connect();
        $query = $db->table('jenis_satuan')->get();
---
SELECT *
FROM `jenis_satuan`