app/Models/PersediaanBahanModel.php

SELECT *
FROM `persediaan_bahan`
JOIN `jenis_satuan` ON `jenis_satuan`.`id_jenis_satuan` = `persediaan_bahan`.`id_jenis_satuan`
WHERE `persediaan_bahan`.`status_aktif` = 1
AND `persediaan_bahan`.`id_perusahaan` = '1'
---
    public function indexPersediaanBahan()
    {
        $query = $this->db->table('persediaan_bahan')
            ->select('*')
            ->join('jenis_satuan', 'jenis_satuan.id_jenis_satuan = persediaan_bahan.id_jenis_satuan')
            ->where('persediaan_bahan.status_aktif', 1)
            ->where('persediaan_bahan.id_perusahaan', session()->get('idPerusahaan'))
            ->get();

INSERT INTO `persediaan_bahan` (`id_perusahaan`, `nama_bahan`, `harga_bahan`, `stok_bahan`, `id_jenis_satuan`, `status_aktif`) VALUES ('1', 'Singkong', '5000', '25', '1', 1)
---
    public function storePersediaanBahan()
    {
        $data = [
            'id_perusahaan' => session()->get('idPerusahaan'),
            'nama_bahan'  => trim($this->request->getVar('nama_bahan')),
            'harga_bahan' => trim($this->request->getVar('harga_bahan')),
            'stok_bahan'  => trim($this->request->getVar('stok_bahan')),
            'id_jenis_satuan' => trim($this->request->getVar('jenis_satuan')),
            'status_aktif' => 1,

        ];
        $this->db->table('persediaan_bahan')->insert($data);

SELECT *
FROM `persediaan_bahan`
WHERE `id_bahan` = '7'
---
    public function editPersediaanBahan($idBahan)
    {
        $query = $this->db->table('persediaan_bahan')->where('id_bahan', $idBahan)->get();