app/Models/SupplierModel.php

    public function editSupplier($idSupplier)
    {
        $query = $this->db->table('supplier')->where('id_supplier', $idSupplier)->get();
---
SELECT *
FROM `supplier`
WHERE `id_supplier` = '7'